; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		d a f r t s h i l o - block
	)
	(:init
		(handempty)
		(clear t)
		(on t a)
		(on a d)
		(on d r)
		(ontable r)
		(clear s)
		(ontable s)
		(clear i)
		(on i f)
		(on f o)
		(on o l)
		(on l h)
		(ontable h)		
	)
	(:goal (and
		;; aft
		(clear a) (ontable t) (on a f) (on f t) 
	))
)

; plan
1. (unstack t a)
   deleted: (clear t) (handempty) (on t a)
   added: (holding t) (clear a)
   goals met: 1 of 4
2. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 2 of 4
3. (unstack i f)
   deleted: (clear i) (handempty) (on i f)
   added: (holding i) (clear f)
   goals met: 2 of 4
4. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 2 of 4
5. (unstack f o)
   deleted: (clear f) (handempty) (on f o)
   added: (holding f) (clear o)
   goals met: 2 of 4
6. (stack f t)
   deleted: (holding f) (clear t)
   added: (clear f) (handempty) (on f t)
   goals met: 3 of 4
7. (unstack a d)
   deleted: (clear a) (handempty) (on a d)
   added: (holding a) (clear d)
   goals met: 2 of 4
8. (stack a f)
   deleted: (holding a) (clear f)
   added: (clear a) (handempty) (on a f)
   goals met: 4 of 4
